# Add Repository
tap 'caskroom/versions'
# tap 'homebrew/binary'
tap 'homebrew/apache'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/science'
tap 'homebrew/versions'
tap 'tkengo/highway'
tap 'tldr-pages/tldr'

# For cask
tap 'phinze/homebrew-cask'
brew 'brew-cask'

# Formula
brew 'cabocha'
brew 'composer'
brew 'git'
brew 'git-flow'
brew 'groff'
brew 'highway'
brew 'httpd24'
brew 'imagemagick'
brew 'jq'
brew 'libjpeg'
brew 'libmcrypt'
brew 'libpng'
brew 'lua'
brew 'mecab'
brew 'mecab-ipadic'
brew 'mercurial'
brew 'mysql'
brew 'nkf'
brew 'opencv'
brew 'r'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'rename'
brew 'thefuck'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'zsh'

# .dmg apps
cask 'alfred'
cask 'bettertouchtool'
cask 'dash'
cask 'dropbox'
cask 'evernote'
cask 'firefox-ja'
cask 'gimp'
cask 'google-chrome'
cask 'google-drive'
cask 'google-japanese-ime'
cask 'haroopad'
cask 'iterm2'
cask 'karabiner'
cask 'mactex'
cask 'mysqlworkbench'
cask 'rstudio'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'thunderbird-ja'
cask 'visual-studio-code'
cask 'xquartz'
cask 'xtrafinder'
